
__author__ = 'Соловьев С.Н.'

# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в данном числе, т.е. 8.
# Подразумевается, что мы не знаем это число заранее.
# Число приходит в виде целого беззнакового.
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании и понимании решите задачу с применением цикла for.

print("Задача-1")
number = input("Введите любое целое число:")
strNum = str(number)
max_number = 0
for i in range(len(strNum)): 
    if max_number < int(strNum[i]):
        max_number = int(strNum[i])  
print("Максимальная цифра в числе:",max_number)

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;
# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.

print("Задача-2")
a = int(input("Введите число a: "))
b = int(input("Введите число b: "))
a, b = b, a
print("Теперь число a превратилось в b:", a)
print("А число b превратилось в a:", b)

# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax² + bx + c = 0.
# Коэффициенты уравнения вводятся пользователем.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:
# import math
# math.sqrt(4) - вычисляет корень числа 4

print("Задача-3")
a = int(input("Введите коэфф-т a:"))
b = int(input("Введите коэфф-т b:"))
c = int(input("Введите коэфф-т c:"))
import math
D = (a**2) - (4*a*c)
if D > 0:
    x1 = (-b + math.sqrt(D))/(2*a)
    x2 = (-b - math.sqrt(D))/(2*a)
    print("1-й корень уравнения:", x1)
    print("2-й корень уравнения:", x2)
elif D == 0:
    x = -b / (2 * a)
    print("Корень уравнения:", x)
else:
    print("Уравнение не имеет корней")
